; domain
(define (domain liftedtcore_minigrid-domain)
 (:requirements :strips :typing :negative-preconditions :disjunctive-preconditions :equality :conditional-effects :existential-preconditions :universal-preconditions :action-costs)
 (:types
    room objectordoor color - object
    object_ door - objectordoor
    empty_0 ball box - object_
 )
 (:constants
   empty - empty_0
   room_4 room_1 room_3 - room
   purple_ball_2 green_ball_1 blue_ball_1 - ball
   purple_door_2 grey_door_1 - door
 )
 (:predicates (agentinroom ?room - room) (objectinroom ?obj - object_ ?room - room) (objectcolor ?objectordoor - objectordoor ?color - color) (at_ ?objectordoor - objectordoor) (carrying ?obj - object_) (locked ?door - door) (adjacentrooms ?room1 - room ?room2 - room ?door - door) (blocked ?door - door ?obj - object_ ?room - room) (visited ?room - room) (emptyhands) (hold_0) (hold_1) (hold_2) (seen_psi_3) (hold_4) (hold_5) (seen_psi_6))
 (:functions (total-cost))
 (:action gotoobject
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (objectinroom ?obj ?room) (agentinroom ?room))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?obj) (increase (total-cost) 1)))
 (:action gotoempty
  :parameters ()
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ empty) (increase (total-cost) 1)))
 (:action gotodoor
  :parameters ( ?door - door ?room1 - room ?room2 - room)
  :precondition (and (adjacentrooms ?room1 ?room2 ?door) (agentinroom ?room1) (forall (?o - object_)
 (not (blocked ?door ?o ?room1))))
  :effect (and(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (at_ ?door) (increase (total-cost) 1)))
 (:action gotoroom
  :parameters ( ?room1 - room ?room2 - room ?door - door)
  :precondition (and (agentinroom ?room1) (adjacentrooms ?room1 ?room2 ?door) (not (locked ?door)) (or (not (or (= ?room2 room_3) (and (agentinroom room_3) (not (= ?room1 room_3))))) (seen_psi_6)))
  :effect (and (not (agentinroom ?room1)) (agentinroom ?room2) (visited ?room2)(forall (?o - object_) (when (at_ ?o) (not (at_ ?o))))(forall (?d - door) (when (at_ ?d) (not (at_ ?d)))) (when (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (hold_0)) (when (and (or (= ?room2 room_4) (and (agentinroom room_4) (not (= ?room1 room_4)))) (not (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))))) (not (hold_1))) (when (or (= ?room2 room_1) (and (agentinroom room_1) (not (= ?room1 room_1)))) (hold_1)) (when (or (= ?room2 room_3) (and (agentinroom room_3) (not (= ?room1 room_3))) (carrying purple_ball_2)) (seen_psi_3)) (when (or (= ?room2 room_3) (and (agentinroom room_3) (not (= ?room1 room_3)))) (hold_5)) (increase (total-cost) 1)))
 (:action pick
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (objectinroom ?obj ?room) (at_ ?obj) (emptyhands))
  :effect (and (not (at_ ?obj)) (not (emptyhands)) (carrying ?obj) (not (objectinroom ?obj ?room))(forall (?d - door) (when (blocked ?d ?obj ?room) (not (blocked ?d ?obj ?room)))) (when (or (agentinroom room_3) (= ?obj purple_ball_2) (carrying purple_ball_2)) (seen_psi_3)) (when (and (not (locked grey_door_1)) (or (= ?obj purple_ball_2) (carrying purple_ball_2))) (hold_4)) (when (or (= ?obj green_ball_1) (carrying green_ball_1) (and (objectinroom blue_ball_1 room_1) (not (and (= ?obj blue_ball_1) (= ?room room_1))))) (seen_psi_6)) (increase (total-cost) 1)))
 (:action drop
  :parameters ( ?obj - object_ ?room - room)
  :precondition (and (agentinroom ?room) (carrying ?obj) (not (emptyhands)) (at_ empty))
  :effect (and (not (carrying ?obj)) (at_ ?obj) (not (at_ empty)) (emptyhands) (objectinroom ?obj ?room) (when (or (agentinroom room_3) (and (carrying purple_ball_2) (not (= ?obj purple_ball_2)))) (seen_psi_3)) (when (and (not (locked grey_door_1)) (carrying purple_ball_2) (not (= ?obj purple_ball_2))) (hold_4)) (when (or (and (carrying green_ball_1) (not (= ?obj green_ball_1))) (and (= ?obj blue_ball_1) (= ?room room_1)) (objectinroom blue_ball_1 room_1)) (seen_psi_6)) (increase (total-cost) 1)))
 (:action toggle
  :parameters ( ?door - door)
  :precondition (and (at_ ?door) (or (and (not (locked ?door)) (= ?door purple_door_2)) (and (locked purple_door_2) (not (and (locked ?door) (= ?door purple_door_2)))) (seen_psi_3)))
  :effect (and (when (not (locked ?door)) (locked ?door)) (when (locked ?door) (not (locked ?door))) (when (not (or (and (not (locked ?door)) (= ?door purple_door_2)) (and (locked purple_door_2) (not (and (locked ?door) (= ?door purple_door_2)))))) (hold_2)) (when (and (not (or (and (not (locked ?door)) (= ?door grey_door_1)) (and (locked grey_door_1) (not (and (locked ?door) (= ?door grey_door_1)))))) (carrying purple_ball_2)) (hold_4)) (increase (total-cost) 1)))
)

; problem
(define (problem liftedtcore_minigrid-problem)
 (:domain liftedtcore_minigrid-domain)
 (:objects
   room_2 - room
   redtype greentype bluetype yellowtype purpletype greytype - color
   purple_door_1 blue_door_1 - door
   purple_ball_1 grey_ball_1 grey_ball_2 red_ball_1 - ball
   grey_box_1 - box
 )
 (:init (agentinroom room_4) (objectinroom green_ball_1 room_1) (objectinroom red_ball_1 room_1) (objectinroom grey_ball_1 room_2) (objectinroom grey_box_1 room_2) (objectinroom purple_ball_1 room_2) (objectinroom purple_ball_2 room_3) (objectinroom blue_ball_1 room_3) (objectinroom grey_ball_2 room_4) (objectcolor green_ball_1 greentype) (objectcolor red_ball_1 redtype) (objectcolor grey_ball_1 greytype) (objectcolor grey_box_1 greytype) (objectcolor purple_ball_1 purpletype) (objectcolor purple_ball_2 purpletype) (objectcolor blue_ball_1 bluetype) (objectcolor grey_ball_2 greytype) (objectcolor purple_door_1 purpletype) (objectcolor blue_door_1 bluetype) (objectcolor grey_door_1 greytype) (objectcolor purple_door_2 purpletype) (emptyhands) (locked purple_door_1) (locked blue_door_1) (locked grey_door_1) (locked purple_door_2) (adjacentrooms room_2 room_1 purple_door_1) (adjacentrooms room_1 room_2 purple_door_1) (adjacentrooms room_3 room_1 blue_door_1) (adjacentrooms room_1 room_3 blue_door_1) (adjacentrooms room_4 room_2 grey_door_1) (adjacentrooms room_2 room_4 grey_door_1) (adjacentrooms room_4 room_3 purple_door_2) (adjacentrooms room_3 room_4 purple_door_2) (visited room_4) (hold_0) (= (total-cost) 0))
 (:goal (and (exists (?d - door)
 (and (objectcolor ?d bluetype) (at_ ?d) (not (locked ?d)))) (hold_0) (hold_1) (hold_2) (hold_4) (hold_5)))
 (:metric minimize (total-cost))
)

; plan
1. (gotodoor grey_door_1 room_4 room_2)
   added: (at_ grey_door_1)
   goals met: 1 of 6
2. (toggle grey_door_1)
   deleted: (locked grey_door_1)
   goals met: 1 of 6
3. (gotoroom room_4 room_2 grey_door_1)
   deleted: (agentinroom room_4) (at_ grey_door_1)
   added: (agentinroom room_2) (visited room_2)
   goals met: 1 of 6
4. (gotodoor purple_door_1 room_2 room_1)
   added: (at_ purple_door_1)
   goals met: 1 of 6
5. (toggle purple_door_1)
   deleted: (locked purple_door_1)
   goals met: 1 of 6
6. (gotoroom room_2 room_1 purple_door_1)
   deleted: (agentinroom room_2) (at_ purple_door_1)
   added: (agentinroom room_1) (visited room_1) (hold_1)
   goals met: 2 of 6
7. (gotodoor blue_door_1 room_1 room_3)
   added: (at_ blue_door_1)
   goals met: 2 of 6
8. (toggle blue_door_1)
   deleted: (locked blue_door_1)
   goals met: 3 of 6
9. (gotoobject green_ball_1 room_1)
   deleted: (at_ blue_door_1)
   added: (at_ green_ball_1)
   goals met: 2 of 6
10. (pick green_ball_1 room_1)
   deleted: (at_ green_ball_1) (emptyhands) (objectinroom green_ball_1 room_1)
   added: (carrying green_ball_1) (seen_psi_6)
   goals met: 2 of 6
11. (gotoroom room_1 room_3 blue_door_1)
   deleted: (agentinroom room_1)
   added: (agentinroom room_3) (visited room_3) (seen_psi_3) (hold_5)
   goals met: 3 of 6
12. (gotodoor purple_door_2 room_3 room_4)
   added: (at_ purple_door_2)
   goals met: 3 of 6
13. (toggle purple_door_2)
   deleted: (locked purple_door_2)
   added: (hold_2)
   goals met: 4 of 6
14. (gotoempty)
   deleted: (at_ purple_door_2)
   added: (at_ empty)
   goals met: 4 of 6
15. (drop green_ball_1 room_3)
   deleted: (carrying green_ball_1) (at_ empty)
   added: (at_ green_ball_1) (emptyhands) (objectinroom green_ball_1 room_3)
   goals met: 4 of 6
16. (gotoobject purple_ball_2 room_3)
   deleted: (at_ green_ball_1)
   added: (at_ purple_ball_2)
   goals met: 4 of 6
17. (pick purple_ball_2 room_3)
   deleted: (at_ purple_ball_2) (emptyhands) (objectinroom purple_ball_2 room_3)
   added: (carrying purple_ball_2) (hold_4)
   goals met: 5 of 6
18. (gotodoor blue_door_1 room_3 room_1)
   added: (at_ blue_door_1)
   goals met: 6 of 6
